implementacion/app/views/becarios/informes_anuales_condonacion.html.erb

<div class="form-group">
  <%= collection_select("select_convocatoria", :conv_seleccionada, Proyecto.where(contrato_id: @becario.contrato_id), :id, :titulo, {}, {:class => 'form-control'}) %>
---
SELECT "proyectos".* FROM "proyectos"  WHERE "proyectos"."contrato_id" IS NULL