implementacion/app/controllers/becarios_controller.rb

SELECT "informes".* FROM "informes"  WHERE "informes"."proyecto_id" IS NULL
---
  def informes_por_convocatoria
    @informes_convocatoria = Informe.where(proyecto_id: params[:conv_seleccionada])