implementacion/app/controllers/becarios_controller.rb

  def index
    @becarios = Becario.all
---
SELECT "becarios".* FROM "becarios"

  def create
    @becario = Becario.new(becario_params)
    # authorize @becario

    respond_to do |format|
      if @becario.save
---
INSERT INTO "becarios" ("apellido1", "apellido2", "ciudad", "condonacion_beneficiarios", "created_at", "cumple_requisitos", "departamento_nacimiento", "direccion_profesional", "direccion_residencial", "email", "fecha_nacimiento", "genero", "info_beneficiario", "info_programa_doctoral", "info_tesis", "nombre", "numero_DI", "registro_pasantia", "telefono", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"

  def informes_anuales_condonacion
    @convocatorias = Proyecto.where(contrato_id: @becario.contrato_id)
---
SELECT "proyectos".* FROM "proyectos"  WHERE "proyectos"."contrato_id" IS NULL

  def set_becario
    @becario = Becario.find(params[:id])
---
SELECT  "becarios".* FROM "becarios"  WHERE "becarios"."id" = $1 LIMIT 1  [["id", 1]]