implementacion/app/controllers/desembolsos_controller.rb

SELECT "desembolsos".* FROM "desembolsos"
---
  def index
    @desembolsos = Desembolso.all