implementacion/app/controllers/visita_tecnicas_controller.rb

  def index
    @visita_tecnicas = VisitaTecnica.all
---
SELECT "visita_tecnicas".* FROM "visita_tecnicas"